{
  "Pune": {
  "Aga Khan Palace": {
    "brief_information": "Built in 1892, the Aga Khan Palace is a historical landmark in Pune, famous for its role in India’s independence movement. It served as a prison for Mahatma Gandhi, Kasturba Gandhi, and Mahadev Desai. The palace houses a museum that displays Gandhi’s personal items, photographs, and historical documents. The Aga Khan Palace was constructed by Sultan Muhammed Shah Aga Khan III as an act of charity to help the famine-affected people of Pune. The palace has an impressive Italian-style architectural design with large hallways and lush gardens. Today, it serves as a memorial to Mahatma Gandhi and is managed by the Gandhi National Memorial Society. Visitors can explore the museum, take a peaceful walk in the gardens, and learn about India’s struggle for freedom. The annual Gandhi Jayanti celebrations here attract many tourists and historians.",
    "timings": "9:00 AM to 5:30 PM",
    "entry_fee": "indians:- Rs.25, foreigners:- Rs.300",
    "location_link": "https://g.co/kgs/SC1G6cC",
    "img_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cd/Pune_Palace.jpg/800px-Pune_Palace.jpg",
    "latitude": 18.5526,
    "longitude": 73.9015
  },
  "Alandi": {
    "brief_information": "Alandi is a sacred town on the banks of the Indrayani River, known as the final resting place of Sant Dnyaneshwar, a revered Marathi saint and poet. The town attracts thousands of devotees, especially during the ‘Palkhi’ procession to Pandharpur. Alandi is an important pilgrimage site, with the Sant Dnyaneshwar Samadhi Mandir being the main attraction. Sant Dnyaneshwar was a 13th-century saint who translated the Bhagavad Gita into Marathi, making it accessible to the common people. The town has numerous temples, ashrams, and dharamshalas to accommodate the large number of pilgrims visiting throughout the year. The spiritual atmosphere, combined with the scenic Indrayani River, makes Alandi a perfect place for meditation and religious activities. The annual Alandi-Pandharpur Wari sees thousands of devotees embarking on a pilgrimage, carrying the sacred ‘Palkhi’ of Sant Dnyaneshwar.",
    "timings": "Open 24 hours",
    "entry_fee": "Free",
    "location_link": "https://g.co/kgs/A76JYw1",
    "img_url": "https://cdn1.tripoto.com/media/filter/tst/img/1702721/SpotDocument/1574273137_1574273096229.jpg.webp",
    "latitude": 18.6783,
    "longitude": 73.8950
  },
  "Bhimashankar Temple": {
    "brief_information": "Bhimashankar Temple is one of the 12 Jyotirlingas of Lord Shiva, located in the Sahyadri Hills. The temple is surrounded by the Bhimashankar Wildlife Sanctuary, making it a great destination for both spiritual seekers and nature lovers. The Bhimashankar Temple, built in the Nagara style of architecture, is believed to be over 1000 years old. It is associated with the legend of Lord Shiva vanquishing the demon Bhima. Apart from its religious significance, Bhimashankar is also known for its trekking trails and dense forests, home to the endangered Indian Giant Squirrel. The temple complex includes several small shrines and a large courtyard where devotees gather for prayers. During Mahashivratri, thousands of pilgrims visit Bhimashankar to seek the blessings of Lord Shiva. The area’s biodiversity and natural beauty make it a favorite among wildlife enthusiasts and adventure seekers.",
    "timings": "4:30 AM to 9:30 PM",
    "entry_fee": "Free",
    "location_link": "https://g.co/kgs/UkRS5rv",
    "img_url": "https://www.mumbaipuneadventures.com/wp-content/uploads/2024/06/Bhimashankar-Jyotirlinga-Temple-tour-from-Mumbai-and-Pune-1080x1080.jpg",
    "latitude": 19.0720,
    "longitude": 73.5359
  },
  "Bhuleshwar Temple": {
    "brief_information": "Bhuleshwar Temple is a historic Shiva temple known for its exquisite carvings and fort-like entrance. Located on a hilltop near Pune, it is famous for its legends and mystical aura. This 13th-century temple was built during the Yadava dynasty and features intricate stone carvings depicting Hindu deities and mythological stories. According to legend, the Shiva Lingam here miraculously drinks milk when offered. The temple's fort-like structure suggests it may have also served as a military outpost. The hilltop location provides breathtaking views of the surrounding landscape, making it a popular spot for photographers and nature lovers. The temple is particularly crowded during Mahashivratri when devotees gather to perform special rituals. The surrounding area also has caves and rock formations that attract trekkers and explorers.",
    "timings": "6:00 AM to 8:00 PM",
    "entry_fee": "Free",
    "location_link": "https://g.co/kgs/92ZXj8T",
    "img_url": "https://kevinstandagephotography.wordpress.com/wp-content/uploads/2017/03/ksp_34231.jpg?w=890",
    "latitude": 18.435874,
    "longitude": 74.241081
  },
  "Dehu": {
    "brief_information": "Dehu is the birthplace of Sant Tukaram, a revered saint of the Bhakti movement. It is a key pilgrimage site for devotees of Lord Vithoba and is famous for its spiritual atmosphere.Dehu is located on the banks of the Indrayani River and is home to the Tukaram Maharaj Temple, dedicated to the great Marathi saint and poet Sant Tukaram. He composed devotional ‘Abhangs’ in praise of Lord Vithoba, inspiring millions of devotees. The town is an important stop in the annual Wari pilgrimage to Pandharpur, where thousands of devotees carry the ‘Palkhi’ (palanquin) of Sant Tukaram. Dehu also has a beautiful ghat along the river, meditation centers, and other small temples that contribute to its peaceful environment. Many visitors come here to experience the divine energy and participate in kirtans (devotional singing) held at the temple. The temple complex includes a hall where Tukaram’s writings are displayed, providing insight into his spiritual contributions.",
    "timings": "Open 24 hours",
    "entry_fee": "Free",
    "location_link": "https://g.co/kgs/ATv14Hf",
    "img_url": "https://halidays.in/wp-content/uploads/2023/09/Dehu_Gatha_Mandir_Pune_Maharashtra.jpg",
    "latitude": 18.7167,
    "longitude": 73.7678
  },
  "Hadsar Fort": {
    "brief_information": "Hadsar Fort is an ancient hill fort known for its rock-cut entrance and scenic trekking route. It was strategically important during the Maratha era. Hadsar Fort, believed to be built during the Satavahana period, was later controlled by the Marathas. The most remarkable feature of the fort is its massive rock-cut gate, which showcases the advanced engineering skills of the time. The fort has caves, water cisterns, and bastions that provide a glimpse into its historical significance. The trek to the fort is of moderate difficulty, passing through lush greenery and rocky terrains. During the monsoon season, the route becomes even more picturesque with waterfalls and misty views. The fort offers panoramic views of the surrounding Sahyadri hills, making it a favorite destination for adventure lovers and history enthusiasts.",
    "timings": "Open 24 hours",
    "entry_fee": "Free",
    "location_link": "https://g.co/kgs/eJmw9US",
    "img_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSKIvZH1qtlPZEBzfzSBm_wwarUnJmo6ONrdw&s",
    "latitude": 19.2708,
    "longitude": 73.8029
  },
  "Katraj Snake Park": {
    "brief_information": "Katraj Snake Park, part of Rajiv Gandhi Zoological Park, is a popular wildlife attraction in Pune. It houses a variety of snakes, including cobras and pythons, along with other reptiles and animals. Established in 1986, Katraj Snake Park is an important conservation and education center dedicated to reptiles. It has over 160 species of snakes, including rare and venomous ones like King Cobras. The park conducts awareness programs about the importance of snakes in the ecosystem. Visitors can also explore the adjacent zoo and lake, making it a complete wildlife experience. The park is a favorite among children and wildlife enthusiasts.",
    "timings": "9:30 AM to 5:00 PM",
    "notes": "Closed on Wednesdays",
    "entry_fee": "adults:- Rs.25, children:- Rs.10",
    "location_link": "https://g.co/kgs/kqYN114",
    "img_url": "https://im.whatshot.in/img/2019/Dec/katraj-1-1576749243.jpg",
    "latitude": 18.4536,
    "longitude": 73.8614
  },
  "Khadakwasla Dam": {
    "brief_information": "Khadakwasla Dam is a major water reservoir supplying water to Pune city. Located near the scenic Sinhagad Fort, it is a popular picnic spot. Khadakwasla Dam, built on the Mutha River, is an important source of water for Pune. The dam was constructed in the 19th century and is known for its serene surroundings and beautiful sunsets. The backwaters of the dam create a picturesque setting, attracting visitors for leisurely strolls, photography, and relaxation. Nearby, there is the famous \"Chowpatty\" area where people can enjoy local snacks like bhajis and corn on the cob. During the monsoon season, the water levels rise, enhancing the beauty of the place. Adventure seekers and nature lovers often visit this spot to unwind and take in the refreshing views. The dam is also close to the National Defence Academy (NDA), adding to its significance.",
    "timings": "Open 24 hours",
    "entry_fee": "Free",
    "location_link": "https://g.co/kgs/gFmG9ib",
    "img_url": "https://storage.googleapis.com/goa-app-12a91.appspot.com/2024-07-09T08%3A20%3A06.759ZAuthorities-released-1-000-cusecs-of-water-from-Kh_1690308075475-%281%29.webp?GoogleAccessId=firebase-adminsdk-zeqcj%40goa-app-12a91.iam.gserviceaccount.com&Expires=16447017600&Signature=X9kENIZZVRUF2Kt%2FdVaaS5q2rL2Qd0RR8AdNwWRLWz9YGxtyVwtJ0EMemh%2FSCHUjzwEL0QFu%2BYKNkD7mLgNSa90gmnmILKf1lYFCButd3QVViuaE0yM1W6vKNhWywHkI3Ftl%2FkKhCBvimT9bnQFOZ8DuT3PPVFp8CM7MeDCGZWz9eoKKlSy3nmeKR9Sio53I0WnPfafFqW93fItonUxUPWEVAhi9zTdFHDsYw8XYfOhQIUEdMaOZG9YPmNIj1FV6aKSvP4BJ26T2To0o%2FAILGqKnkL5pZr3wooESbKba%2F%2FT0dWDAS%2FGy2rgcyjYXE2dFOxmW6vfy4zn0FzV0FqnG%2FA%3D%3D",
    "latitude": 18.4392,
    "longitude": 73.7725
  },
  "Korigad Fort": {
    "brief_information": "Korigad Fort is a historic hill fort near Lonavala, known for its well-preserved walls, stunning views, and easy trekking route. It was captured by Chhatrapati Shivaji Maharaj in 1657 and later incorporated into the Maratha Empire.",
    "long_information": "Korigad Fort stands at an elevation of about 929 meters and offers a panoramic view of the Amby Valley. The fort is famous for its large walls, bastions, and temples dedicated to Goddess Korai Devi and Lord Vishnu. The trek to Korigad is relatively easy, making it an ideal destination for beginners and adventure enthusiasts. The fort has several water cisterns and caves, adding to its historical charm. During the monsoon, the fort is covered in lush greenery, making it a perfect spot for nature lovers and photographers. A large plateau on top provides a great place for camping and enjoying the scenic beauty.",
    "timings": "Open 24 hours",
    "entry_fee": "Free",
    "location_link": "https://g.co/kgs/DpUi1LU",
    "img_url": "https://storage.googleapis.com/goa-app-12a91.appspot.com/2024-05-17T07%3A12%3A41.513Z2022-10-25.webp?GoogleAccessId=firebase-adminsdk-zeqcj%40goa-app-12a91.iam.gserviceaccount.com&Expires=16447017600&Signature=XW7W%2FTrBJOuZC22DMlOnNOjk9folfGC%2BI%2BsoiXAK1ssUoNoFOj5qb%2BtofpcXrlpe3X9Z6udWxDrmKCNn5nITaYFSq1ZiHYNZhE0SXconagVX4CSM69p%2FnT7LQkwRuq5t00PvxrZY12%2B1V%2FuRZ0Me%2FvP%2BUdMUv1a7YJxwu4u9w7YnHWjJ0dg%2FqvNX%2Bu%2B8uTv7nzmvRP1%2FtfrQ3WEf%2BW0OH5Fkt7bufWRTYykpq7DvkHMVqbwrGGV0Hn%2FkxDBBnsxqnYjEq266lQUA6WASOGZvaQihSZjthqm6cBSF9qOwQDfc4uxK39Tr33wCBUMEbIKb3KzuCxilxi7GTp2aljbLmA%3D%3D",
    "latitude": 18.6212,
    "longitude": 73.3857
  },
  "Laal Mahal": {
    "brief_information": "Laal Mahal is a historic palace in Pune, known for its association with Chhatrapati Shivaji Maharaj. It was originally built by Shahaji Raje for his wife Jijabai and young Shivaji.Laal Mahal was constructed in 1630 AD and served as the childhood home of Chhatrapati Shivaji Maharaj. The palace has undergone several renovations, and today, it serves as a memorial showcasing important events of Shivaji's life. It is famous for the episode where Shivaji Maharaj attacked Shaista Khan, a Mughal general, and cut off his fingers. The museum inside the palace displays paintings, artifacts, and a replica of Raigad Fort, offering insights into the Maratha empire. Visitors can explore its well-maintained surroundings and relive history through the exhibits.",
    "timings": "9:00 AM to 1:00 PM, 4:00 PM to 8:00 PM",
    "entry_fee": "Rs.5",
    "location_link": "https://g.co/kgs/TmmRTvS",
    "img_url": "https://travelsetu.com/apps/uploads/new_destinations_photos/destination/2023/12/27/f8745e931992190b556e1d31a0ec8135_1000x1000.jpg",
    "latitude": 18.5187,
    "longitude": 73.8566
  },
  "Lohagad Fort": {
    "brief_information": "Lohagad Fort is a popular trekking destination near Lonavala, known for its strong fortifications and panoramic views. Lohagad Fort, meaning \"Iron Fort,\" was built during the Satavahana period and later occupied by several dynasties, including the Marathas. The fort was used by Chhatrapati Shivaji Maharaj to store his treasury. Standing at an altitude of 3,389 feet, it offers breathtaking views of the surrounding valleys, Pawna Lake, and the lush greenery of the Sahyadris. The trek to Lohagad is beginner-friendly, making it a favorite among trekkers and nature lovers. The fort has several structures, including four grand gates, water tanks, and caves. During the monsoon season, the trail becomes even more scenic, attracting adventure seekers.",
    "timings": "Open 24 hours",
    "entry_fee": "Free",
    "location_link": "https://maps.app.goo.gl/RYE73k7pRHZccDAg7",
    "img_url": "https://storage.googleapis.com/goa-app-12a91.appspot.com/2024-05-15T10%3A47%3A06.597Zlohagad-fort.webp?GoogleAccessId=firebase-adminsdk-zeqcj%40goa-app-12a91.iam.gserviceaccount.com&Expires=16447017600&Signature=QphHIRNzkktY83JZsbsbspRGLOMWu2QeP45sCD9h6%2FNE%2F6OCRXJtDQWYmF8Lwq8p1N4V4hgfynS2H9Nsd36eZCkwjFEnaJrGAQzS%2BdFVTYOal%2BPeIU2dGtuUWBypKI17Riuybg%2Fkjq9Il0L7WXrZw8Xf%2BvloLChIQhZkQL4%2BwSXJfDupZKwTul8WKq7FPWbTx56VzTLOGG3M%2FlUhY5biyyQtGHCPnP%2FY%2BmOhoQsQdSo9MhPy8%2BqtJ1%2F0SRrksOY090e11zDfrTMvN1erkGwhMqKu16zrKg3BoRUgg6dw5qhaRhH%2BsC57HwD10iyCASdRKzz5ndjIC2RryYK%2FnTQJ%2Bg%3D%3D",
    "latitude": 18.7100,
    "longitude": 73.4765
  },
  "Malhargad Fort": {
    "brief_information": "Malhargad Fort, also known as Sonori Fort, is one of the last forts built by the Marathas, located near Pune. It offers a scenic trekking experience with breathtaking views of the surrounding landscape. Malhargad Fort was constructed in the late 18th century by Peshwa generals Bhivrao Yashwant and Krishnaji Madhavrao Panse. It was named after Lord Malhari (an incarnation of Lord Shiva), whose temple is located inside the fort. The fort was primarily used as an outpost to keep an eye on enemy movements towards Pune. Though relatively smaller than other forts in the region, Malhargad has significant historical value. The fort features strong ramparts, water reservoirs, and remnants of old structures. It is a popular trekking destination, offering a moderate trail suitable for beginners. The surrounding area, especially during the monsoon, is covered with lush greenery, making it a favorite among nature lovers and photographers.",
    "timings": "Open 24 hours",
    "entry_fee": "Free",
    "location_link": "https://maps.app.goo.gl/aY7p8Jk4eMFLJA9E6",
    "img_url": "https://kevinstandagephotography.wordpress.com/wp-content/uploads/2018/03/ksp_2323.jpg",
    "latitude": 18.4121,
    "longitude": 74.0495
  },
  "Mulshi Dam": {
    "brief_information": "Mulshi Dam is a major dam located in the Pune district, known for its scenic beauty and as a popular weekend getaway. It serves as a hydroelectric power source and offers breathtaking views of the Sahyadri ranges. Mulshi Dam is built on the Mula River and is a crucial water source for Pune city. Constructed primarily for hydroelectric power generation, it is a part of the Tata Power Company’s project. The dam is surrounded by lush greenery, dense forests, and picturesque hills, making it an ideal spot for nature lovers and photographers. Tourists often visit for boating, camping, and picnics. The monsoon season enhances its beauty, with waterfalls and mist-covered landscapes adding to its charm. Adventure seekers can also explore nearby attractions such as Tamhini Ghat and Andharban Trek. Despite its growing popularity, the region remains serene and relatively untouched, providing a peaceful escape from city life.",
    "timings": "Open 24 hours",
    "entry_fee": "Free",
    "location_link": "https://maps.app.goo.gl/xXw8Az9BMpLczAcdA",
    "img_url": "https://youtellme.ai/wp-content/uploads/2024/10/DJI_0867-scaled.jpg",
    "latitude": 18.5324,
    "longitude": 73.4622
  },
  "Nighoj": {
    "brief_information": "Nighoj is a small village in the Ahmednagar district, famous for its naturally occurring potholes along the banks of the Kukadi River. These geological formations are unique and attract tourists and researchers alike.Nighoj is home to a rare and fascinating natural phenomenon—giant potholes created by the force of the Kukadi River over thousands of years. These rock formations, known as the \"Nighoj Potholes\" or \"Ranjan Khalge,\" are among the largest in Asia. Scientists believe the potholes were formed due to the continuous flow of water eroding the basalt rock. The site is a significant geological wonder and has become a major attraction for nature enthusiasts and geologists. The nearby Malganga Temple adds a spiritual touch to the visit. Tourists can walk along the bridges or trails around the river to witness the remarkable patterns carved by nature. The best time to visit is during the dry season when the river levels are low, making the formations more visible.",
    "timings": "Open 24 hours",
    "entry_fee": "Free",
    "location_link": "https://maps.app.goo.gl/nYy74GSKNi86qzhr7",
    "img_url": "https://sandeepachetan.com/wp-content/uploads/2013/04/nighoj-potholes.jpg",
    "latitude": 18.9575,
    "longitude": 74.2810
  },
  "Panshet Dam": {
    "brief_information": "Panshet Dam, also known as Tanaji Sagar Dam, is a popular tourist attraction near Pune, offering water sports and scenic surroundings. It serves as a major water supply source for the city.Built on the Ambi River, Panshet Dam is one of Pune’s primary water reservoirs. The dam, constructed in the 1950s, gained historical significance due to the Panshet flood of 1961 when it collapsed, causing severe flooding in Pune. Today, it is a favorite spot for tourists looking for a peaceful retreat. Visitors can enjoy boating, kayaking, and other water activities in the reservoir. The lush green hills surrounding the dam make it an ideal location for picnics and photography. The road to Panshet offers scenic drives with picturesque views, especially during the monsoon season. Nearby attractions include Khadakwasla Dam and Sinhagad Fort, making it a great place for a day trip from Pune.",
    "timings": "Open 24 hours",
    "entry_fee": "Free",
    "img_url": "https://c8.alamy.com/comp/R7140B/versgaon-dam-panshet-pune-maharashtra-india-R7140B.jpg",
    "location_link": "https://maps.app.goo.gl/6raRdaxorBbcEGPK9",
    "latitude": 18.3494,
    "longitude": 73.5550
  },
  "Rajgad Fort": {
    "brief_information": "Rajgad Fort, meaning \"King's Fort,\" was the first capital of the Maratha Empire under Chhatrapati Shivaji Maharaj. It is one of Maharashtra’s most famous trekking destinations.Rajgad Fort, perched at an altitude of 1,376 meters, was the capital of the Maratha Empire for over 26 years before the capital was moved to Raigad. The fort is known for its massive structure and historical significance. It has four main sections: Padmavati Machi, Suvela Machi, Sanjeevani Machi, and Balekilla, each offering stunning views and strategic importance. The fort has several gates, water cisterns, and remnants of old structures, including the palace ruins and a temple dedicated to Goddess Padmavati. Trekkers love the challenging trails leading to the fort, making it a popular adventure spot. The best time to visit is post-monsoon when the entire fort is covered in lush greenery, and the weather is pleasant.",
    "timings": "Open 24 hours",
    "entry_fee": "Free",
    "img_url": "https://preview.redd.it/vrqz5jxdxe871.jpg?width=1080&crop=smart&auto=webp&s=35ea71972ab0d830759d54530cfb6b2f1d985e0b",
    "location_link": "https://maps.app.goo.gl/SHzD9y5NhtqitSf77",
    "latitude": 18.2466,
    "longitude": 73.6822
  },
  "Sarasbaug": {
    "brief_information": "Sarasbaug is a famous garden and temple complex in Pune, known for its lush greenery and the iconic Ganesh temple at its center. It is a favorite spot for evening strolls and family outings.Originally a lake, Sarasbaug was transformed into a garden by the Peshwas in the 18th century. The central attraction is the Sarasbaug Ganapati Temple, built by Madhavrao Peshwa in 1784. The temple houses a revered idol of Lord Ganesha and is visited by thousands of devotees every year. The garden area is beautifully maintained, with walking paths, fountains, and benches for relaxation. Sarasbaug is also a great spot for birdwatching, as many migratory birds can be seen here during different seasons. The place is bustling with activity, with street food vendors and a lively atmosphere, especially in the evenings. It is a peaceful retreat in the middle of the city, perfect for families and history lovers alike.",
    "timings": "6:00 AM to 9:00 PM",
    "entry_fee": "Free",
    "location_link": "https://maps.app.goo.gl/p7NXLvDsFZEKbzUN9",
    "img_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTn8A52TcJXunTZkBHjOsDTJMDKU243fc1VGQ&s",
    "latitude": 18.5014,
    "longitude": 73.8529
  },
  "Shaniwar Wada": {
    "brief_information": "Shaniwar Wada is a historic fortification in Pune that served as the seat of the Peshwas of the Maratha Empire. It is famous for its grand architecture, historical significance, and mysterious legends.Built in 1732 by Bajirao I, Shaniwar Wada was the political center of the Maratha Empire until its fall in 1818. The fort was originally a grand structure with massive gates, intricately designed halls, and gardens, but much of it was destroyed in a fire in 1828. Today, visitors can explore the remains of the fort, including the grand entrance, the foundation of the main palace, and the beautiful gardens. The fort is known for its haunting legends, with many believing it to be haunted by the ghost of Narayanrao Peshwa. A sound and light show held in the evening narrates the fort’s rich history, making it a must-visit attraction in Pune.",
    "timings": "9:00 AM to 5:30 PM",
    "entry_fee": "indians:- Rs.25 , foreigners:-Rs.300",
    "location_link": "https://maps.app.goo.gl/P9eBx1xWg7mTFfdD8",
    "img_url": "https://media.istockphoto.com/id/1396387056/photo/crowd-in-front-of-historical-monument-in-pune.jpg?s=612x612&w=0&k=20&c=U1GAH6gZcE4dWffAOWk0DO4Hz7x7bGiEuiCUPHf6Izc=",
    "latitude": 18.5196,
    "longitude": 73.8554
  },
  "Shivneri Fort": {
    "brief_information": "Shivneri Fort is the birthplace of Chhatrapati Shivaji Maharaj, the founder of the Maratha Empire. It is a historically significant fort and a popular trekking destination.Located in Junnar, Shivneri Fort is a 17th-century fort that played a crucial role in Maratha history. This fort is where Shivaji Maharaj was born in 1630 and spent his early childhood. The fort is surrounded by strong walls and has seven gates leading to the top. Key attractions inside the fort include the Shivai Temple, a water reservoir called Badami Talav, and the house where Shivaji was born, which is well-preserved. The trek to the fort is moderately challenging, with stunning views of the Sahyadri ranges. Shivneri Fort stands as a symbol of Maratha pride and attracts history lovers, trekkers, and devotees alike.",
    "timings": "6:00 AM to 6:00 PM",
    "entry_fee": "Free",
    "location_link": "https://maps.app.goo.gl/F1q4SzZhJGH9yDrD7",
    "img_url": "https://thumbs.dreamstime.com/b/shivneri-fort-steps-towards-junnar-87067173.jpg",
    "latitude": 19.1931,
    "longitude": 73.8555
  },
  "Shrimant Dagdushet Temple": {
    "brief_information": "The Shrimant Dagdusheth Halwai Ganpati Temple is one of Pune’s most famous and revered temples, attracting thousands of devotees and tourists every year Built over 125 years ago by a wealthy sweet maker, Dagdusheth Halwai, in memory of his lost son, this temple has become a major pilgrimage site. The temple is dedicated to Lord Ganesha, and the idol is adorned with gold ornaments donated by devotees. The temple is a center of grand celebrations during the Ganesh Chaturthi festival, where devotees from all over India come to offer their prayers. The temple's trust is actively involved in various charitable and social activities. The temple’s serene atmosphere, well-organized darshan system, and cultural significance make it a must-visit in Pune.",
    "timings": "6:00 AM to 11:00 PM",
    "entry_fee": "Free",
    "location_link": "https://maps.app.goo.gl/Ugb752pJYNAnVsvu9",
    "img_url": "https://www.shutterstock.com/image-photo/pune-maharashtra-india-february-28-600nw-2144100157.jpg",
    "latitude": 18.5164,
    "longitude": 73.8561
  },
  "Sinhagad Fort": {
    "brief_information": "Sinhagad Fort is one of the most famous forts in Maharashtra, known for its historical significance and scenic trekking trails.Located about 35 km from Pune, Sinhagad Fort is a favorite destination for history buffs and trekking enthusiasts. The fort has witnessed several battles, including the famous Battle of Sinhagad in 1670, where Tanaji Malusare fought bravely for Chhatrapati Shivaji Maharaj. The fort’s ruins and the memorial of Tanaji remind visitors of its glorious past. The fort is also popular for its breathtaking sunrise views and the local delicacies like 'pithla bhakri' and 'kanda bhaji' available at small stalls. The fort can be reached by road or by trekking, making it an ideal spot for a weekend adventure.",
    "timings": "Open 24 hours",
    "entry_fee": "Free",
    "location_link": "https://maps.app.goo.gl/xwfrapHWpiomTxft9",
    "img_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSAVpqDlrzPwSrTsUVHSxBO5jP4JoR3Y-J8Kg&s",
    "latitude": 18.3663,
    "longitude": 73.7559
  },
  "Tamhini Ghat": {
    "brief_information": "Tamhini Ghat is a picturesque mountain pass known for its lush greenery, waterfalls, and misty landscapes, especially during the monsoon season. Tamhini Ghat, situated on the Western Ghats, connects Pune with the Konkan region. The ghat is famous for its stunning natural beauty, dense forests, and multiple waterfalls that appear during the monsoon season. It is a paradise for nature lovers, bikers, and photographers. The route is dotted with scenic viewpoints, making it a great drive from Pune. Adventure enthusiasts often visit for trekking, camping, and birdwatching. Nearby attractions like Mulshi Dam and Andharban Trek make it an even more exciting spot for explorers.",
    "timings": "Open 24 hours",
    "entry_fee": "Free",
    "location_link": "https://maps.app.goo.gl/rgPSGP2w8QutcW38A",
    "img_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ-YCscJhEEfZI-58NszstMXhrZx8LIVsasOQ&s",
     "latitude": 18.4759,
    "longitude": 73.4592
  },
  "Torna Fort": {
    "brief_information": "Torna Fort, also known as Prachandgad, is the highest fort in Pune district and holds immense historical importance. Torna Fort was the first fort captured by Chhatrapati Shivaji Maharaj in 1646 at the age of 16, marking the beginning of the Maratha Empire. Perched at an altitude of 4,603 feet, the fort offers breathtaking panoramic views of the Sahyadri mountain ranges. The trek to Torna is considered moderately difficult, attracting adventure enthusiasts. The fort has several gates, water reservoirs, temples, and fortifications that tell the story of its glorious past. The route is most scenic during the monsoon, with mist-covered valleys and blooming wildflowers.",
    "timings": "Open 24 hours",
    "entry_fee": "Free",
    "location_link": "https://maps.app.goo.gl/2NLi9763G4ADQh9m9",
    "img_url": "https://escape2explore.s3.ap-south-1.amazonaws.com/UpdatedMedia/4c506fc4-4457-4d83-87d0-c6e03c966c7a.webp",
    "latitude": 18.2769,
    "longitude": 73.6219
  },
  "Visapur Fort": {
    "brief_information": "Visapur Fort is a historical fort located near Lonavala, known for its stunning views, trekking trails, and historical ruins.Built during the early 18th century by Balaji Vishwanath, the first Peshwa of the Maratha Empire, Visapur Fort stands at an elevation of 3,556 feet. The fort is larger and situated higher than the nearby Lohagad Fort. The trek to Visapur is popular among adventure seekers due to its lush green surroundings and monsoon waterfalls. The fort features caves, water tanks, and old houses, giving insight into its past. The breathtaking view from the top makes it a perfect spot for photography and nature lovers.",
    "timings": "Open 24 hours",
    "entry_fee": "Free",
    "location_link": "https://maps.app.goo.gl/Dh8QrknA1Z3qDjtf6",
    "img_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQtnP5gM430c_7X3kcX7boyLJvJigKj8GIm9g&s",
    "latitude": 18.7236,
    "longitude": 73.4905
  }
  },

  "Mumbai": {
    "Gateway of India": {
      "brief_information": "The Gateway of India is one of the most famous structures of Mumbai which draws thousands of tourists to this city. The arch can be found in Colaba and it is positioned right at the edge of Arabian Sea, making it a great site for photography and sightseeing. The monument marks the visit of the George V and Queen Mary to India in 1911. It was built in 1924 and serves as one of the most visited places in India. It was designed and constructed in Indo-Saracenic, Mughal, and Gothic architectural styles.",
      "timings": "Accessible 24 hours, with caution recommended during late night hours. Best times to visit are early morning or late at night.",
      "entry_fee": "Free entry for all visitors.",
      "location_link": "https://maps.app.goo.gl/gX6xJzLe88c1VTc88",
      "img_url": "https://t3.ftcdn.net/jpg/02/00/55/94/360_F_200559473_wEDZgxSDPPjQfgX3sQqXcjz4ph1a79Yt.jpg",
      "latitude": 18.923071,
      "longitude": 72.84183

    },
    "Chhatrapati Shivaji Maharaj Terminus (CSMT)": {
      "brief_information": "Previously known as Victoria Terminus (VT), CSMT is a UNESCO World Heritage Site and an iconic symbol of Mumbai. Situated in South Mumbai, it's an exemplary structure of Victorian Gothic Revival architecture and the headquarters of the Central Railway of India. Constructed in 1887 to honor Queen Victoria's Golden Jubilee.",
      "timings": "Open 24 hours. Nighttime is optimum for viewing the lighted structure.",
      "entry_fee": "Free for general access; nominal charge for the Heritage Gallery.",
      "location_link": "https://maps.app.goo.gl/ho4MJixFAEVPhhGm6",
      "img_url": "https://live.staticflickr.com/896/39483907170_552c7cae7e_h.jpg",
       "latitude": 18.939914,
      "longitude": 72.835495

    },
    "Marine Drive": {
      "brief_information": "A famous 3.6 km waterfront along the Arabian Sea, connecting Nariman Point, Churchgate, and Malabar Hill. Known as the 'Queen's Necklace' because the streetlights resemble a sparkling necklace at night. Ideal for strolls and sunset views.",
      "timings": "Open 24 hours. Best time to visit is early morning or evening.",
      "entry_fee": "Free.",
      "location_link": "https://maps.app.goo.gl/1kTpdHseDHnLemkx6",
      "img_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRz2wyWraZ7X-1XgipWRKanRCwypmmiZfaT3A&s",
      "latitude": 18.931105,
      "longitude": 72.825767

    },
    "Elephanta Caves": {
      "brief_information": "A UNESCO World Heritage Site located on Elephanta Island in Mumbai Harbour, featuring impressive rock-cut temple complexes dedicated to Lord Shiva, dating back to the 5th-7th century. Traditionally called Gharapuri ('the city of caves')[cite: 336]. The main cave (Cave 1) houses the famous Trimurti statue.",
      "timings": "9:00 AM – 5:30 PM (Closed on Mondays).",
      "entry_fee": "Rs.40 (Indians), Rs.600 (Foreigners). Additional ferry charges apply (Rs.200-250 round trip from Gateway of India).",
      "location_link": "https://maps.app.goo.gl/nRb718p1p11NvNT4A",
      "img_url": "https://s7ap1.scene7.com/is/image/incredibleindia/1-elephanta-caves-mumbai-maharashtra-attr-hero?qlt=82&ts=1727355530211",
      "latitude": 18.9633,
      "longitude":72.9315

    },
    "Siddhivinayak Temple": {
      "brief_information": "One of India's most famous Hindu temples dedicated to Lord Ganesha, located in Prabhadevi[cite: 350, 351]. Constructed in 1801, it's believed to grant devotees' wishes[cite: 352, 354]. The Ganesha idol is sculpted from a single black stone with the trunk turned to the right[cite: 355].",
      "timings": "Wednesday to Monday: 5:30 AM – 9:50 PM. Tuesdays: 3:15 AM – 12:30 AM (next day).",
      "entry_fee": "Free entry (Donations welcome).",
      "location_link": "https://maps.app.goo.gl/TUkTXiokpHZxvivAA",
      "img_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTOUL8HMwnbmhnrt5DDMBdyH0ZBXyKCQ18wRQ&s",
       "latitude": 19.0170,
      "longitude": 72.8304

    },
    "Haji Ali Dargah": {
      "brief_information": "An iconic mosque and shrine situated on a small islet off the Worli coast. It contains the tomb of Saint Pir Haji Ali Shah Bukhari. Constructed in 1431, it's a symbol of unity and peace. Built in Indo-Islamic and Mughal-inspired white marble. Accessible via a causeway only during low tide.",
      "timings": "5:30 AM – 10:00 PM (Open daily).",
      "entry_fee": "Free entry (Donations are welcome).",
      "location_link": "https://maps.app.goo.gl/12BUfiTcGCM6bBx38",
      "img_url": "https://www.visittnt.com/blog/wp-content/uploads/2018/05/haji-alidargah.jpg",
       "latitude": 18.9828,
      "longitude": 72.8089

    },
    "Juhu Beach": {
      "brief_information": "One of Mumbai's most visited beaches in the western suburbs, known for golden sand, sunsets, and street food. It offers panoramic views of the Arabian Sea. Close to residences of Bollywood celebrities.",
      "timings": "Open 24 hours. Best time to visit is early morning or evening.",
      "entry_fee": "Free.",
      "location_link": "https://maps.app.goo.gl/emy3hsD5Bdf9mkjc8",
      "img_url": "https://mumbaitourism.co.in/wp-content/uploads/2024/02/Juhu-Beach-in-Mumbai.webp",
       "latitude": 19.1048,
      "longitude": 72.8267

    },
     "Girgaon Chowpatty": {
      "brief_information": "Also known as Chowpatty Beach, located along Marine Drive. Popular for sunset views, street food, and its lively ambiance. Main site for Ganesh Visarjan during the Ganesh Chaturthi festival.",
      "timings": "Open 24 hours. Optimum time to visit is evening.",
      "entry_fee": "Free.",
      "location_link": "https://maps.app.goo.gl/FimGTe9bx3zg2n7Q9",
       "img_url": "https://www.holidify.com/images/cmsuploads/compressed/26331952423_bd13719581_h_20170907172426.jpg",
       "latitude": 18.9547,
      "longitude": 72.8139

    },
    "Sanjay Gandhi National Park (SGNP)": {
      "brief_information": "A large city-based national park offering a green oasis within Mumbai, covering 103 sq. km. Home to diverse wildlife, including leopards and over 270 bird species, and the ancient Kanheri Caves. Offers trekking, cycling, wildlife safaris, and a toy train ride.",
      "timings": "7:30 AM to 6:30 PM (Closed on Mondays).",
      "entry_fee": "Rs.85 (Adults), Rs.45 (Child). Extra charges for safaris, cave visits, and toy train[.",
      "location_link": "https://maps.app.goo.gl/YErncsjkWN6szjNo9",
      "img_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/30/Entrance_of_Sanjay_Gandhi_National_Park.JPG/284px-Entrance_of_Sanjay_Gandhi_National_Park.JPG",
       "latitude": 19.2205,
      "longitude": 72.9128

    },
    "Chor Bazaar": {
      "brief_information": "One of Mumbai's oldest markets, known as the 'Thieves' Market'. A paradise for shoppers seeking antiques, vintage items, quirky collectibles, and bargain hunting. Find vintage Bollywood posters, gramophones, cameras, furniture, and more.",
      "timings": "11:00 AM – 7:30 PM (Closed on Fridays).",
      "entry_fee": "Free entry (Shopping prices depend on bargaining).",
      "location_link": "https://maps.app.goo.gl/jnnLaVhKj4PL6uAP8",
      "img_url": "https://i.ytimg.com/vi/JkSUhG8ZVfA/hq720.jpg?sqp=-oaymwEhCK4FEIIDSFryq4qpAxMIARUAAAAAGAElAADIQj0AgKJD&rs=AOn4CLCS_N0XQulAHzrccxbPzaSuNoP9fg",
      "latitude": 18.9605,
      "longitude": 72.8251
    },
     "Mount Mary Church": {
      "brief_information": "Also known as the Basilica of Our Lady of the Mount, located in Bandra. A 300-year-old Roman Catholic church situated atop a hill overlooking the Arabian Sea. Features Gothic-style architecture. Hosts the popular annual Bandra Fair in September.",
      "timings": "6:00 AM to 8:30 PM every day.",
      "entry_fee": "Free to visit.",
      "location_link": "https://maps.app.goo.gl/VwJSXJJXbnmKmchT8",
       "img_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b3/Mount_Mary_Church_%28Bombay%29.jpg/1200px-Mount_Mary_Church_%28Bombay%29.jpg",
       "latitude": 19.0466,
      "longitude": 72.8225

    },
    "Sassoon Dock": {
      "brief_information": "One of Mumbai's oldest docks, located in Colaba. Constructed in 1875 by David Sassoon, it remains a primary fishing dock and seafood trade cente. Features a bustling fish market and has become a space for street art and exhibitions through the Sassoon Dock Art Project.",
      "timings": "Open daily; best to visit early morning for market activity.",
      "entry_fee": "Free to visit the pier.",
      "location_link": "https://maps.app.goo.gl/CQwqwkXSy6HAukeF9",
      "img_url": "https://upload.wikimedia.org/wikipedia/commons/0/0c/Sassoon_Docks_overhead_2.jpg",
      "latitude": 18.9144,
      "longitude": 72.8245

    },
    "Five Gardens": {
      "brief_information": "A serene park in the Matunga neighborhood, divided into five sections. Offers a peaceful escape with well-manicured gardens. Established by the British in the early 20th century. Good for walks, jogging, picnics, and photography.",
      "timings": "Daily from 5:30 AM to 10:00 PM.",
      "entry_fee": "Free of cost.",
      "location_link": "https://maps.app.goo.gl/a8gXi7XDbWWamV1r6",
      "img_url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/15/f9/3d/87/photo1jpg.jpg?w=900&h=500&s=1",
       "latitude": 19.0197,
      "longitude": 72.8543

    },
    "Crawford Market": {
      "brief_information": "Officially Mahatma Jyotiba Phule Mandai, a popular and busy market in the Fort locality, established in 1869. Known for its Victorian-Gothic architecture. Offers a wide range of products including fresh produce, spices, dry fruits, flowers, pets, home decor, and more.",
      "timings": "Open throughout the week from 10:00 AM until 8:00 PM.",
      "entry_fee": "Free to visit.",
      "location_link": "https://maps.app.goo.gl/6mBHiSw38xEGpFUk7",
      "img_url": "https://upload.wikimedia.org/wikipedia/commons/1/16/Crawford_Market.png",
      "latitude": 18.947622,
      "longitude": 72.834442

    },
     "Rajabai Clock Tower": {
      "brief_information": "An iconic landmark in the Fort area near Mumbai University, built in 1869. A fine example of Victorian Gothic architecture with Indian influences, modeled after Big Ben. Stands 85 meters tall. Constructed in remembrance of Rajabai, mother of Premchand Roychand.",
      "timings": "Visible from outside at any time. Entry to the tower is restricted.",
      "entry_fee": "Free for viewing from outside.",
      "location_link": "https://maps.app.goo.gl/Ghsy71zTQoTY5NrEA",
       "img_url": "https://assets.architecturaldigest.in/photos/614438feacb73cba8ed55cd6/1:1/w_1080,h_1080,c_limit/Rajabai%20clock%20tower%20Mumbai.png",
        "latitude": 18.92964,
      "longitude": 72.82999

    },
    "Mumbadevi Temple": {
      "brief_information": "One of Mumbai's oldest and most sacred temples, located in Zaveri Bazaar. Dedicated to Mumbadevi, the patron deity of the city. Dates back to the 14th century. The name 'Mumbai' is believed to derive from the goddess Mumba. Features traditional Hindu temple architecture.",
      "timings": "Every day from 5:00 AM to 9:00 PM.",
      "entry_fee": "Free to visit (donations encouraged).",
      "location_link": "https://maps.app.goo.gl/SLwrmmqTzqn9Ap1L9",
      "img_url": "https://mumbaitourism.travel/images/places-to-visit/headers/mumba-devi-temple-mumbai-tourism-entry-fee-timings-holidays-reviews-header.jpg",
      "latitude": 18.956259,
      "logitude":72.830193

    },
    "Hanging Gardens": {
      "brief_information": "Also known as Pherozeshah Mehta Gardens, located on Malabar Hill. Offers panoramic views of Marine Drive, the Arabian Sea, and the Queen's Necklace. Features terraced gardens, animal-shaped topiaries, and flower beds. Ideal for leisurely walks.",
      "timings": "Daily from 5:00 AM to 9:00 PM.",
      "entry_fee": "Free admission.",
      "location_link": "https://maps.app.goo.gl/kdynYQUWoXM5BCxn8",
      "img_url": "https://s7ap1.scene7.com/is/image/incredibleindia/hanging-gardens-mumbai-maharashtra-attr-hero-2?qlt=82&ts=1727355293819",
       "latitude": 18.9566,
      "longitude": 72.8050

    },
     "Chhatrapati Shivaji Maharaj Vastu Sangrahalaya": {
      "brief_information": "Formerly the Prince of Wales Museum, located near Kala Ghoda in the Fort area. A prominent museum showcasing Indian history, culture, and art, with emphasis on Chhatrapati Shivaji Maharaj. Established in 1905, it features Indo-Saracenic architecture. Contains sections on Maratha history, art & sculpture, natural history, and foreign art.",
      "timings": "Open daily from 10:15 AM to 6:00 PM (Closed on Mondays).",
      "entry_fee": "Adults: Rs.100 (Indian), Rs.500 (Foreigners). Children (6-12 years): Rs.25. Free for children under 6 and on specific days.",
      "location_link": "https://maps.app.goo.gl/cVT2F9L4E6rvuiFC9",
       "img_url": "https://s7ap1.scene7.com/is/image/incredibleindia/1-chatrapati-shivaji-maharaj-vastu-sangrahalaya-or-prince-of-wales-museum-mumbai-maharashtra-attr-hero?qlt=82&ts=1727355300214",
       "latitude": 18.9269,
      "longitude": 72.8327

    },
    "Colaba Causeway": {
      "brief_information": "An iconic and lively street in southern Mumbai, famous for its bustling market and street shopping. Offers clothes, accessories, handicrafts, antiques, and souvenirs. Close to landmarks like the Gateway of India and Taj Mahal Palace Hote. Features cafes like Leopold Café.",
      "timings": "Market open all day; best visited from late morning to early evening.",
      "entry_fee": "Free to browse; prices negotiable.",
      "location_link": "https://maps.app.goo.gl/Q6Fuxdk3hodEMhyt7",
      "img_url": "https://media1.thrillophilia.com/filestore/0c2q6sb29aiy9jik8bu7vkjn2ca1_veqww3aozq4nadv1c6tl77cry8l3_shutterstock_1123949642.webp",
       "latitude": 18.9168,
      "longitude": 72.8272

    },
    "Film City": {
      "brief_information": "Officially Dadasaheb Phalke Chitranagari, located in Goregaon East. The heart of Bollywood, where many movies, TV shows, and ads are filmed. Offers guided tours of studio sets, including replicas of landmarks. Opportunity for celebrity sightings.",
      "timings": "Generally open for tours between 9:00 AM and 5:00 PM (Check timings as they may vary).",
      "entry_fee": "Tour entry entry_fee vary from Rs.500 to Rs.2,000 depending on the tour type.",
      "location_link": "https://maps.app.goo.gl/cWFgaUCPz1kuw5PF7",
      "img_url": "https://mumbaitourism.co.in/wp-content/uploads/2024/04/Film-City-Mumbai.webp",
      "latitude": 19.1608,
      "longitude": 72.8876
    }
  }}